{"basics":{"name":"Taehun Cha","image":"","email":"cth127@korea.ac.kr","url":"https://cth127.github.io/"},"education":[{"institution":"Korea University","studyType":"PhD Candidate in Applied Mathematics","startDate":"2022-03-01"},{"institution":"Korea University","studyType":"MFE in Financial Engineering","startDate":"2020-03-01","endDate":"2022-02-28","summary":"Thesis: Understanding the Yield Curve Shift with FOMC Statements: NLP Perspective"},{"institution":"Yonsei University","studyType":"BA in Sociology and Cultural Critics","startDate":"2012-03-01","endDate":"2019-08-31"}],"work":[{"name":"Korea Telecom","position":"PhD Student Research Intern","startDate":"2023-07-01","endDate":"2023-08-31","summary":"Researched the hallucination problem in large language models (LLM). Built an automatized pipeline to construct a hallucination dataset using ChatGPT and a reward model to train LLM with RL. Selected as an outstanding intern."}],"publications":[{"name":"Evaluating Generalization Capabilities of LLM-Based Agents in Mixed-Motive Scenarios Using Concordia.","publisher":"The Thirty-ninth Annual Conference on Neural Information Processing Systems Datasets and Benchmarks Track","releaseDate":"2025-09-19","url":"https://openreview.net/forum?id=yG4Fj0voJZ","summary":"In this paper we introduce a method for evaluating cooperation in LLM-based agents with unfamiliar co-players in novel, mixed-motive scenarios, and report the analytical techniques, methods, and results of the 2024 Concordia Contest."},{"name":"Emergent Linear Separability of Unseen Data Points in High-dimensional Last-Layer Feature Space.","publisher":"Workshop on High-dimensional Learning Dynamics at ICML 2024","releaseDate":"2025-06-26","url":"https://openreview.net/forum?id=ZycrmjxehT","summary":"We propose a simple geometric uncertainty measure based on linear separability in the last-layer feature space of deep networks, offering a theoretically grounded and non-probabilistic approach to uncertainty quantification."},{"name":"ABC3: Active Bayesian Causal Inference with Cohn Criteria in Randomized Experiments.","publisher":"In The 39th Annual AAAI Conference on Artificial Intelligence","releaseDate":"2025-02-25","url":"https://arxiv.org/abs/2412.11104","summary":"We introduce ABC3, a highly efficient active learning method for randomized experiment, with several theoretical properties."},{"name":"Pre-trained Language Models Return Distinguishable Probability Distributions to Unfaithfully Hallucinated Texts.","publisher":"Findings of the Association for Computational Linguistics: EMNLP 2024 (EMNLP 2024 Findings)","releaseDate":"2024-11-16","url":"https://aclanthology.org/2024.findings-emnlp.738/","summary":"We show the pre-trained language models return distinguishable generation probability and uncertainty distribution to unfaithfully hallucinated texts, regardless of their size and structure."},{"name":"Evaluating Extrapolation Ability of Large Language Model in Chemical Domain.","publisher":"Language + Molecules Workshop at ACL 2024. (Lang+Moles@ACL 2024)","releaseDate":"2024-08-15","url":"https://aclanthology.org/2024.langmol-1.4/","summary":"LLM can extrapolate to new unseen material utilizing its chemical knowledge learned through massive pre-training."},{"name":"SentenceLDA: Discriminative and Robust Document Representation with Sentence Level Topic Model","publisher":"In Proceedings of the 18th Conference of the European Chapter of the\nAssociation for Computational Linguistics (EACL 2024)","releaseDate":"2024-03-22","url":"https://aclanthology.org/2024.eacl-long.31/","summary":"We propose SentenceLDA, a sentence-level topic model. We combine modern SentenceBERT and classical LDA to extend the semantic unit from word to sentence."},{"name":"Noun-MWP: Math Word Problems Meet Noun Answers","publisher":"In Proceedings of the 29th International Conference on Computational Linguistics (COLING 2022)","releaseDate":"2022-10-17","url":"https://aclanthology.org/2022.coling-1.338/","summary":"We introduce a new type of problems for math word problem (MWP) solvers, named Noun-MWPs, whose answer is a non-numerical string containing a noun from the problem text."}],"awards":[{"title":"Concordia Contest @ Neruips 2024 - First Place out of 197 participants","date":"2024-12-15","awarder":"Cooperative AI Foundation and Google Deepmind","summary":"Designed and developed an LLM-based AI agent that maximizes expected reward while maintaining a cooperative stance."},{"title":"AI Grand Challenge - 7nd Place","date":"2023-12-08","awarder":"Ministry of Science and ICT","summary":"Designed and led the development of an open-domain, multi-hop, multi-modal,document-based report-generating system. (team leader)"},{"title":"AI Grand Challenge Open Track - 2nd Place","date":"2023-09-01","awarder":"Ministry of Science and ICT","summary":"Developed an open-domain, multi-hop, multi-modal document QA system and achieved 2nd place out of 12 teams."},{"title":"Korean AI Competition - 4th Place","date":"2022-09-01","awarder":"Ministry of Science and ICT","summary":"Developed Automatic Speech Recognition model for Korean and achieved 4th place out of 103 teams. (team leader)"},{"title":"AI Grand Challenge","date":"2021-09-01","awarder":"Ministry of Science and ICT","summary":"Developed an NLP model to solve elementary math word problems based on KLUE-RoBERTa, and we were selected for follow-up research. (team leader)"},{"title":"HAAFOR NLP Challenge 2020 - 3rd place","date":"2020-09-31","awarder":"HAAFOR","summary":"Achieved 3rd place(70.27% accuracy) on text order prediction task with ALBERT model."}],"certificates":[{"name":"Financial Risk Manager","date":"2022-04-30","issuer":"Global Association of Risk Professionals"}]}